Repository: IlanF/child-theme-generator-wp-plugin
Catalog: languages/*.po
Languages: he_il

source: Child Theme Generator
he_il: יוצר תבניות הבת

source: The current theme &ldquo;%s&rdquo; is not a child theme.
he_il: התבנית הנוכחית &ldquo;%s&rdquo; אינה תבנית בת.

source: Child themes are the recommended way of modifying an existing theme.
he_il: תבנית בת הינה הדרך המומלצת לערוך תבנית קיימת.

source: Hide notice for &ldquo;%s&rdquo; theme
he_il: הסתר הודעה עבור תבנית "%s"

source: Create a child theme
he_il: יצירת תבנית בת

source: There has been a problem processing your request.
he_il: אותרה שגיאה בהשלמת הפעולה.

source: Success
he_il: הצלחה

source: Failure
he_il: כישלון

source: The child theme was created.
he_il: תבנית הבת נוצרה.

source: There has been a problem creating the child theme.
he_il: קרתה שגיאה במהלך יצירת תבנית הבת.

source: The child theme was activated successfully.
he_il: תבנית הבת הופעלה בהצלחה.

source: The child theme could not be activated at this time.
he_il: לא ניתן להפעיל את תבנית הבת ברגע זה.

source: Close
he_il: סגור

source: Activate theme now
he_il: הפעל תבנית כעת

source: Basic Settings
he_il: הגדרות בסיסיות

source: Parent Theme
he_il: תבנית אם

# parent theme selection active theme
source: (Current)
he_il: (נוכחי)

source: Toggle panel: Customize Child Theme Details
he_il: הצג/הסתר את התאמה אישית של פרטי התבנית

source: Customize Child Theme Details
he_il: התאמה אישית של פרטי התבנית

source: If you wish to distribute your child theme you may want to fill in the theme details bellow.
he_il: במידה ותרצה להפיץ את תבנית הבת תרצה למלא את פרטי התבנית למטה.

source: These fields are required if you want to upload the theme to the WordPress Theme Directory.
he_il: שדות אלו הם חובה במידה ותרצה להעלות את התבנית אל מאגר התוספים של WordPress.

source: Theme Name
he_il: שם התבנית

# Theme name placeholder
source: My New Child Theme
he_il: שם תבנית הבת החדשה שלי

source: Theme URI
he_il: קישור התבנית

source: Description
he_il: תיאור

# Description placeholder
source: Short description for my new theme
he_il: תיאור קצר של התבנית החדשה שלי

source: Author
he_il: היוצר

source: Author Name
he_il: שם היוצר

source: Author Homepage
he_il: קישור היוצר

source: Version
he_il: גירסה

source: The text-domain is used for translations
he_il: משמש לתרגומים

source: Tags
he_il: תגיות

source: License
he_il: רשיון

source: License Name
he_il: שם רשיון

source: Full License URL
he_il: קישור לרשיון המלא

source: License Excerpt
he_il: תקציר הרשיון

# License excerpt placeholder
source: Short license excerpt
he_il: תקציר הרשיון

source: WordPress requires that themes will be licensed under a GPL compatible license.
he_il: וורדפרס מחייב שהתבניות יופצו תחת רשיון תואם GPL.

source: Stylesheet comments
he_il: הערות נוספות

# Stylesheet comments placeholder
source: Add a comment to your style.css file
he_il: הוסף הערות נוספות לקובץ ה- style.css של התבנית

source: Create Child Theme
he_il: יצירת תבנית בת

source: I just want the style.css header
he_il: אני רק רוצה את כותרת ה- style.css

source: Creating child theme...
he_il: יוצר תבנית בת...

source: This block is updated automatically as you change the theme information.
he_il: תיבה זו מתעדכנת אוטומטית כשפרטי התבנית משתנים.
